YoungSooBae1224/SensorShield-EVK-003-nRF52/RPR0521RS/main.c
uint8_t tx_flag = 0;

/**@brief Platform functions used by the sensor driver(s).
 *
 * @details Entry point for the platform specific features such as TWI.
 */
struct platform_functions nrf52_funcs;


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Send data to tx link */
void ble_uart_tx(uint8_t * data, uint16_t size) {
    
    ret_code_t ret;
#if 0
    NRF_LOG_INFO("ble_uart_tx: ");
    NRF_LOG_HEXDUMP_INFO(p_string, *p_length);
    NRF_LOG_INFO("\r\n");
#endif
    if(m_conn_handle != BLE_CONN_HANDLE_INVALID && tx_flag == 1)
    {
        do
        {
            ret = ble_nus_data_send(&m_nus,data,&size,m_conn_handle);
            if(ret != NRF_SUCCESS)
            {
                NRF_LOG_INFO("%s err=%d\r\n", __func__, ret);
            }
            if ((ret != NRF_ERROR_INVALID_STATE) &&
                (ret != NRF_ERROR_RESOURCES) &&
                (ret != NRF_ERROR_NOT_FOUND) &&
                (ret != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
            {
                APP_ERROR_CHECK(ret);
            }
        } while (ret == NRF_ERROR_RESOURCES);
    }
}

float convert_lx(uint16_t *data)
{
    float lx;
    float d0, d1, d1_d0;

    if(_als_data0_gain == 0)
    {
        return RPR0521RS_ERROR;
    }

    if(_als_data1_gain == 0)
    {
        return RPR0521RS_ERROR;
    }

    if(_als_measure_time == 0)
    {
        return RPR0521RS_ERROR;
    }
    else if(_als_measure_time == 50)
    {
        if((data[0]&0x8000) == 0x8000)
        {
            data[0] = 0x7FFF;
        }

        if((data[1]&0x8000) == 0x8000)
        {
            data[1] = 0x7FFF;
        }
    }

    d0 = (float)data[0]*(100/_als_measure_time)/_als_data0_gain;
    d1 = (float)data[1]*(100/_als_measure_time)/_als_data1_gain;

    if(d0 == 0)
    {
        lx = 0;
        return lx;
    }

    d1_d0 = d1/d0;

    if(d1_d0 < 0.595)
    {
        lx = (1.682*d0 - 1.877*d1);
    }
    else if(d1_d0 < 1.015)
    {
        lx = (0.644*d0 - 0.132*d1);
    }
    else if(d1_d0 < 1.352)
    {
        lx = (0.756*d0 - 0.243*d1);
    }
    else if(d1_d0 < 3.053)
    {
        lx = (0.766*d0 - 0.25*d1);
    }
    else
    {
        lx = 0;
    }

    return lx;
}

static void repeated_timer_handler(void * p_context)
{
    uint8_t data[6]={0,}, size;
    uint16_t data_16[3]={0,};
    static float als_val_avr[5]={0,};
    static uint16_t ps_val_avr[5]={0,};
    RPR_0521RS_get_raw(data,&size);

    data_16[0] = (data[0]<<8|data[1]);
    data_16[1] = (data[2]<<8|data[3])>>8;
    data_16[2] = (data[4]<<8|data[5])>>8;

    /*NRF_LOG_INFO( "PS %4d / ALS0 %4d / ALS1 %4d",
                data_16[0],data_16[1],data_16[2]);

    if( data_16[0] >= RPR0521RS_NEAR_THRESH )
    {
        NRF_LOG_INFO("NEAR!");
    }
    else
    {
        NRF_LOG_INFO("FAR!");
    }*/
    
    float als_val;
    uint16_t ps_val;
    
    als_val_avr[4] = als_val_avr[3];
    als_val_avr[3] = als_val_avr[2];
    als_val_avr[2] = als_val_avr[1];
    als_val_avr[1] = als_val_avr[0];
    als_val_avr[0] = convert_lx(&data_16[1]);
    als_val = (als_val_avr[0]+als_val_avr[1]+als_val_avr[2]+als_val_avr[3]+als_val_avr[4])/5.0;
    
    ps_val_avr[4] = ps_val_avr[3];
    ps_val_avr[3] = ps_val_avr[2];
    ps_val_avr[2] = ps_val_avr[1];
    ps_val_avr[1] = ps_val_avr[0];
    ps_val_avr[0] = data_16[0];
    ps_val = (ps_val_avr[0]+ps_val_avr[1]+ps_val_avr[2]+ps_val_avr[3]+ps_val_avr[4])/5.0;

    char ps_data[20]={0,};
    char als_data[30]={0,};
    char sensor_data[50]={0,};
    sprintf(als_data,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(als_val));
    sprintf(ps_data,"%d",ps_val);
    sprintf(sensor_data,"%s/%s",ps_data,als_data);

    /*if(als_val != RPR0521RS_ERROR)
    {
        NRF_LOG_INFO(NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(als_val));
    }*/

    int cnt;
    for(cnt = 0 ; cnt < 256 ; cnt++)
    {
        if(sensor_data[cnt] == 0)
        {
            break;
        }
    }

    NRF_LOG_INFO("%s",NRF_LOG_PUSH(sensor_data));

    ble_uart_tx((uint8_t *)sensor_data, cnt);
}


/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(500), NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if(p_evt->type == BLE_NUS_EVT_COMM_STARTED) {
        tx_flag = 1;
    }else if(p_evt->type == BLE_NUS_EVT_RX_DATA){
        // do nothing        
    } else if(p_evt->type == BLE_NUS_EVT_TX_RDY){
        // SD TX buffers are free
        NRF_LOG_INFO("%s TX complete\r\n", __func__);
        tx_flag = 0;
    }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

